Revit 2027 API
CircleLightShape Class
 This class encapsulates a circle light shape.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightShape
 Autodesk.Revit.DB.Lighting.CircleLightShape
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class CircleLightShape : LightShape
Public Class CircleLightShape
	Inherits LightShape
public ref class CircleLightShape : public LightShape
type CircleLightShape =
    class
        inherit LightShape
    end
The CircleLightShape type exposes the following members.
Constructors
Name | Description
CircleLightShape() |  Creates a circle light shape object with 2.0' emit diameter.
CircleLightShape(CircleLightShape) |  Creates a copy of the given circle light shape
CircleLightShape(Double) |  Creates a circle light shape object with the given emit diameter.
Top
Properties
Name | Description
EmitDiameter |  The emit diameter.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightShape)
Top
Methods
Name | Description
Clone |  Creates a copy of the LightShape derived object.
(Inherited from LightShape)
Dispose
(Inherited from LightShape)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace